# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as  pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
first=np.random.randint(1,5,100)
second=np.random.randint(1,4,100)
third=np.random.randint(10000,30001,100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
first_series=pd.Series(first,name='First')
second_series=pd.Series(second,name='Second')
third_series=pd.Series(third,name='Third')
df=pd.concat([first_series,second_series,third_series],axis=1)

In [7]:
df.head()

   First  Second  Third
0      3       1  11575
1      2       2  24555
2      1       1  14105
3      4       3  10151
4      1       3  17416

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [8]:
df.rename(columns={'First':'bedrs','Second':'bathrs','Third':'price_sqr_meter'},inplace=True)
df.tail()

    bedrs  bathrs  price_sqr_meter
95      2       2            15049
96      4       2            14214
97      1       3            23103
98      2       1            29869
99      1       3            23239

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [9]:
newdata=pd.concat([first_series,second_series,third_series])
bigcolumn=pd.DataFrame(newdata)
bigcolumn.tail()

        0
95  15049
96  14214
97  23103
98  29869
99  23239

In [12]:
type(newdata)

pandas.core.series.Series

In [10]:
bigcolumn.shape

(300, 1)

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [14]:
bigcolumn.head()

   0
0  3
1  2
2  1
3  4
4  1

In [15]:
bigcolumn.iloc[96:104]

    0
96  4
97  1
98  2
99  1
0   1
1   2
2   1
3   3

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [16]:
bigcolumn.reset_index()

     index      0
0        0      3
1        1      2
2        2      1
3        3      4
4        4      1
..     ...    ...
295     95  15049
296     96  14214
297     97  23103
298     98  29869
299     99  23239

[300 rows x 2 columns]